RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_sctimer.c
    if ((s_currentEvent + 2U) <= (uint32_t)FSL_FEATURE_SCT_NUMBER_OF_EVENTS)
    {
        /* Use bi-directional mode for center-aligned PWM */
        if (mode == kSCTIMER_CenterAlignedPwm)
        {
            base->CTRL |= SCT_CTRL_BIDIR_L_MASK;
        }

        /* Calculate PWM period match value */
        if (mode == kSCTIMER_EdgeAlignedPwm)
        {
            period = (sctClock / pwmFreq_Hz) - 1U;
        }
        else
        {
            period = sctClock / (pwmFreq_Hz * 2U);
        }

        /* Calculate pulse width and period match value:
         * For EdgeAlignedPwm, "pulsePeriod = 0" results in 0% dutycyle, "pulsePeriod = period - 1U" results in 100%
         * dutycyle. For CenterAlignedPwm, , "pulsePeriod = 0" results in 0% dutycyle, "pulsePeriod = period + 2U"
         * results in 100% dutycyle.
         */

        pulsePeriod = (uint32_t)(((uint64_t)period * pwmParams->dutyCyclePercent) / 100U);

        if (pwmParams->dutyCyclePercent >= 100U)
        {
            if (mode == kSCTIMER_EdgeAlignedPwm)
            {
                pulsePeriod = period + 2U;
            }
            else
            {
                pulsePeriod = period - 1U;
            }
        }

        /* Schedule an event when we reach the PWM period */
        status =
            SCTIMER_CreateAndScheduleEvent(base, kSCTIMER_MatchEventOnly, period, 0, kSCTIMER_Counter_U, &periodEvent);

        /* Schedule an event when we reach the pulse width */
        status2 = SCTIMER_CreateAndScheduleEvent(base, kSCTIMER_MatchEventOnly, pulsePeriod, 0, kSCTIMER_Counter_U,
                                                 &pulseEvent);

        if ((kStatus_Success == status) && (kStatus_Success == status2))
        {
            /* Reset the counter when we reach the PWM period */
            SCTIMER_SetupCounterLimitAction(base, kSCTIMER_Counter_U, periodEvent);

            /* Return the period event to the user */
            *event = periodEvent;

            /* For high-true level */
            if ((uint32_t)pwmParams->level == (uint32_t)kSCTIMER_HighTrue)
            {
                /* Set the initial output level to low which is the inactive state */
                base->OUTPUT &= ~(1UL << (uint32_t)pwmParams->output);

                if (mode == kSCTIMER_EdgeAlignedPwm)
                {
                    /* Set the output when we reach the PWM period */
                    SCTIMER_SetupOutputSetAction(base, (uint32_t)pwmParams->output, periodEvent);
                    /* Clear the output when we reach the PWM pulse value */
                    SCTIMER_SetupOutputClearAction(base, (uint32_t)pwmParams->output, pulseEvent);
                }
                else
                {
                    /* Clear the output when we reach the PWM pulse event */
                    SCTIMER_SetupOutputClearAction(base, (uint32_t)pwmParams->output, pulseEvent);
                    /* Reverse output when down counting */
                    reg = base->OUTPUTDIRCTRL;
                    reg &= ~((uint32_t)SCT_OUTPUTDIRCTRL_SETCLR0_MASK << (2U * (uint32_t)pwmParams->output));
                    reg |= (1UL << (2U * (uint32_t)pwmParams->output));
                    base->OUTPUTDIRCTRL = reg;
                }
            }
            /* For low-true level */
            else
            {
                /* Set the initial output level to high which is the inactive state */
                base->OUTPUT |= (1UL << (uint32_t)pwmParams->output);

                if (mode == kSCTIMER_EdgeAlignedPwm)
                {
                    /* Clear the output when we reach the PWM period */
                    SCTIMER_SetupOutputClearAction(base, (uint32_t)pwmParams->output, periodEvent);
                    /* Set the output when we reach the PWM pulse value */
                    SCTIMER_SetupOutputSetAction(base, (uint32_t)pwmParams->output, pulseEvent);
                }
                else
                {
                    /* Set the output when we reach the PWM pulse event */
                    SCTIMER_SetupOutputSetAction(base, (uint32_t)pwmParams->output, pulseEvent);
                    /* Reverse output when down counting */
                    reg = base->OUTPUTDIRCTRL;
                    reg &= ~((uint32_t)SCT_OUTPUTDIRCTRL_SETCLR0_MASK << (2U * (uint32_t)pwmParams->output));
                    reg |= (1UL << (2U * (uint32_t)pwmParams->output));
                    base->OUTPUTDIRCTRL = reg;
                }
            }
        }
        else
        {
            status = kStatus_Fail;
        }
    }

    return status;
}

/*!
 * brief Updates the duty cycle of an active PWM signal.
 *
 * Before calling  this function, the counter is set to operate as one 32-bit counter (unify bit is set to 1).
 *
 * param base              SCTimer peripheral base address
 * param output            The output to configure
 * param dutyCyclePercent  New PWM pulse width; the value should be between 0 to 100
 * param event             Event number associated with this PWM signal. This was returned to the user by the
 *                          function SCTIMER_SetupPwm().
 */
void SCTIMER_UpdatePwmDutycycle(SCT_Type *base, sctimer_out_t output, uint8_t dutyCyclePercent, uint32_t event)

{
    assert(dutyCyclePercent <= 100U);
    assert((uint32_t)output < (uint32_t)FSL_FEATURE_SCT_NUMBER_OF_OUTPUTS);
    assert(1U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));

    uint32_t periodMatchReg, pulseMatchReg;
    uint32_t pulsePeriod = 0, period;

    /* Retrieve the match register number for the PWM period */
    periodMatchReg = base->EV[event].CTRL & SCT_EV_CTRL_MATCHSEL_MASK;

    /* Retrieve the match register number for the PWM pulse period */
    pulseMatchReg = base->EV[event + 1U].CTRL & SCT_EV_CTRL_MATCHSEL_MASK;

    period = base->MATCH[periodMatchReg];

    /* Calculate pulse width and period match value:
     * For EdgeAlignedPwm, "pulsePeriod = 0" results in 0% dutycyle, "pulsePeriod = period - 1U" results in 100%
     * dutycyle. For CenterAlignedPwm, , "pulsePeriod = 0" results in 0% dutycyle, "pulsePeriod = period + 2U"
     * results in 100% dutycyle.
     */
    pulsePeriod = (uint32_t)(((uint64_t)period * dutyCyclePercent) / 100U);

    if (dutyCyclePercent == 100U)
    {
        if (0U == (base->CTRL & SCT_CTRL_BIDIR_L_MASK))
        {
            pulsePeriod = period + 2U;
        }
        else
        {
            pulsePeriod = period - 1U;
        }
    }

